[
    {
        "title": "Stream-DiffVSR: Low-Latency Streamable Video Super-Resolution via Auto-Regressive Diffusion",
        "summary": "Diffusion-based video super-resolution (VSR) methods achieve strong perceptual quality but remain impractical for latency-sensitive settings due to reliance on future frames and expensive multi-step denoising. We propose Stream-DiffVSR, a causally conditioned diffusion framework for efficient online VSR. Operating strictly on past frames, it combines a four-step distilled denoiser for fast inference, an Auto-regressive Temporal Guidance (ARTG) module that injects motion-aligned cues during latent denoising, and a lightweight temporal-aware decoder with a Temporal Processor Module (TPM) that enhances detail and temporal coherence. Stream-DiffVSR processes 720p frames in 0.328 seconds on an RTX4090 GPU and significantly outperforms prior diffusion-based methods. Compared with the online SOTA TMP, it boosts perceptual quality (LPIPS +0.095) while reducing latency by over 130x. Stream-DiffVSR achieves the lowest latency reported for diffusion-based VSR, reducing initial delay from over 4600 seconds to 0.328 seconds, thereby making it the first diffusion VSR method suitable for low-latency online deployment. Project page: https://jamichss.github.io/stream-diffvsr-project-page/",
        "url": "http://arxiv.org/abs/2512.23709v1",
        "published_date": "2025-12-29T18:59:57+00:00",
        "updated_date": "2025-12-29T18:59:57+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Hau-Shiang Shiu",
            "Chin-Yang Lin",
            "Zhixiang Wang",
            "Chi-Wei Hsiao",
            "Po-Fan Yu",
            "Yu-Chih Chen",
            "Yu-Lun Liu"
        ],
        "tldr": "Stream-DiffVSR introduces a low-latency, causally-conditioned diffusion framework for online video super-resolution, achieving significant speedups and improved perceptual quality compared to existing diffusion-based methods. It's the first diffusion VSR method suitable for low-latency online deployment.",
        "tldr_zh": "Stream-DiffVSR 提出了一种低延迟、因果条件扩散框架，用于在线视频超分辨率，与现有的基于扩散的方法相比，实现了显著的加速和更高的感知质量。 这是第一个适用于低延迟在线部署的扩散 VSR 方法。",
        "relevance_score": 10,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]