[
    {
        "title": "IRPO: Boosting Image Restoration via Post-training GRPO",
        "summary": "Recent advances in post-training paradigms have achieved remarkable success in high-level generation tasks, yet their potential for low-level vision remains rarely explored. Existing image restoration (IR) methods rely on pixel-level hard-fitting to ground-truth images, struggling with over-smoothing and poor generalization. To address these limitations, we propose IRPO, a low-level GRPO-based post-training paradigm that systematically explores both data formulation and reward modeling. We first explore a data formulation principle for low-level post-training paradigm, in which selecting underperforming samples from the pre-training stage yields optimal performance and improved efficiency. Furthermore, we model a reward-level criteria system that balances objective accuracy and human perceptual preference through three complementary components: a General Reward for structural fidelity, an Expert Reward leveraging Qwen-VL for perceptual alignment, and a Restoration Reward for task-specific low-level quality. Comprehensive experiments on six in-domain and five out-of-domain (OOD) low-level benchmarks demonstrate that IRPO achieves state-of-the-art results across diverse degradation types, surpassing the AdaIR baseline by 0.83 dB on in-domain tasks and 3.43 dB on OOD settings. Our code can be shown in https://github.com/HaoxuanXU1024/IRPO.",
        "url": "http://arxiv.org/abs/2512.00814v1",
        "published_date": "2025-11-30T09:42:24+00:00",
        "updated_date": "2025-11-30T09:42:24+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Haoxuan Xu. Yi Liu",
            "Boyuan Jiang",
            "Jinlong Peng",
            "Donghao Luo",
            "Xiaobin Hu",
            "Shuicheng Yan",
            "Haoang Li"
        ],
        "tldr": "The paper introduces IRPO, a novel post-training method for image restoration based on GRPO (Generative Reward Policy Optimization) that leverages a carefully designed reward system and data formulation strategy to improve performance and generalization, achieving state-of-the-art results.",
        "tldr_zh": "该论文介绍了IRPO，一种新颖的基于GRPO（生成奖励策略优化）的图像恢复后训练方法，它利用精心设计的奖励系统和数据制定策略来提高性能和泛化能力，实现了最先进的结果。",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "Provenance-Driven Reliable Semantic Medical Image Vector Reconstruction via Lightweight Blockchain-Verified Latent Fingerprints",
        "summary": "Medical imaging is essential for clinical diagnosis, yet real-world data frequently suffers from corruption, noise, and potential tampering, challenging the reliability of AI-assisted interpretation. Conventional reconstruction techniques prioritize pixel-level recovery and may produce visually plausible outputs while compromising anatomical fidelity, an issue that can directly impact clinical outcomes. We propose a semantic-aware medical image reconstruction framework that integrates high-level latent embeddings with a hybrid U-Net architecture to preserve clinically relevant structures during restoration. To ensure trust and accountability, we incorporate a lightweight blockchain-based provenance layer using scale-free graph design, enabling verifiable recording of each reconstruction event without imposing significant overhead. Extensive evaluation across multiple datasets and corruption types demonstrates improved structural consistency, restoration accuracy, and provenance integrity compared with existing approaches. By uniting semantic-guided reconstruction with secure traceability, our solution advances dependable AI for medical imaging, enhancing both diagnostic confidence and regulatory compliance in healthcare environments.",
        "url": "http://arxiv.org/abs/2512.00999v1",
        "published_date": "2025-11-30T17:48:55+00:00",
        "updated_date": "2025-11-30T17:48:55+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Mohsin Rasheed",
            "Abdullah Al-Mamun"
        ],
        "tldr": "This paper proposes a semantic-aware medical image reconstruction framework using a hybrid U-Net and blockchain-based provenance tracking to improve structural consistency and ensure trustworthiness in AI-assisted medical imaging.",
        "tldr_zh": "该论文提出了一种语义感知的医学图像重建框架，使用混合U-Net和基于区块链的溯源跟踪，以提高结构一致性并确保AI辅助医学成像的可靠性。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]