[
    {
        "title": "One Small Step in Latent, One Giant Leap for Pixels: Fast Latent Upscale Adapter for Your Diffusion Models",
        "summary": "Diffusion models struggle to scale beyond their training resolutions, as direct high-resolution sampling is slow and costly, while post-hoc image super-resolution (ISR) introduces artifacts and additional latency by operating after decoding. We present the Latent Upscaler Adapter (LUA), a lightweight module that performs super-resolution directly on the generator's latent code before the final VAE decoding step. LUA integrates as a drop-in component, requiring no modifications to the base model or additional diffusion stages, and enables high-resolution synthesis through a single feed-forward pass in latent space. A shared Swin-style backbone with scale-specific pixel-shuffle heads supports 2x and 4x factors and remains compatible with image-space SR baselines, achieving comparable perceptual quality with nearly 3x lower decoding and upscaling time (adding only +0.42 s for 1024 px generation from 512 px, compared to 1.87 s for pixel-space SR using the same SwinIR architecture). Furthermore, LUA shows strong generalization across the latent spaces of different VAEs, making it easy to deploy without retraining from scratch for each new decoder. Extensive experiments demonstrate that LUA closely matches the fidelity of native high-resolution generation while offering a practical and efficient path to scalable, high-fidelity image synthesis in modern diffusion pipelines.",
        "url": "http://arxiv.org/abs/2511.10629v1",
        "published_date": "2025-11-13T18:54:18+00:00",
        "updated_date": "2025-11-13T18:54:18+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Aleksandr Razin",
            "Danil Kazantsev",
            "Ilya Makarov"
        ],
        "tldr": "The paper introduces Latent Upscaler Adapter (LUA), a lightweight module for efficient super-resolution in diffusion models by operating directly on the latent code, resulting in faster and comparable image quality with strong generalization ability.",
        "tldr_zh": "该论文介绍了一种轻量级模块 Latent Upscaler Adapter (LUA)，它通过直接在潜在代码上操作，实现扩散模型中的高效超分辨率，从而实现更快且质量相当的图像，并具有强大的泛化能力。",
        "relevance_score": 10,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]