[
    {
        "title": "RDDM: Practicing RAW Domain Diffusion Model for Real-world Image Restoration",
        "summary": "We present the RAW domain diffusion model (RDDM), an end-to-end diffusion\nmodel that restores photo-realistic images directly from the sensor RAW data.\nWhile recent sRGB-domain diffusion methods achieve impressive results, they are\ncaught in a dilemma between high fidelity and realistic generation. As these\nmodels process lossy sRGB inputs and neglect the accessibility of the sensor\nRAW images in many scenarios, e.g., in image and video capturing in edge\ndevices, resulting in sub-optimal performance. RDDM bypasses this limitation by\ndirectly restoring images in the RAW domain, replacing the conventional\ntwo-stage image signal processing (ISP) + IR pipeline. However, a simple\nadaptation of pre-trained diffusion models to the RAW domain confronts the\nout-of-distribution (OOD) issues. To this end, we propose: (1) a RAW-domain VAE\n(RVAE) learning optimal latent representations, (2) a differentiable Post Tone\nProcessing (PTP) module enabling joint RAW and sRGB space optimization. To\ncompensate for the deficiency in the dataset, we develop a scalable degradation\npipeline synthesizing RAW LQ-HQ pairs from existing sRGB datasets for\nlarge-scale training. Furthermore, we devise a configurable multi-bayer (CMB)\nLoRA module handling diverse RAW patterns such as RGGB, BGGR, etc. Extensive\nexperiments demonstrate RDDM's superiority over state-of-the-art sRGB diffusion\nmethods, yielding higher fidelity results with fewer artifacts.",
        "url": "http://arxiv.org/abs/2508.19154v1",
        "published_date": "2025-08-26T16:06:17+00:00",
        "updated_date": "2025-08-26T16:06:17+00:00",
        "categories": [
            "eess.IV",
            "cs.AI",
            "cs.CV"
        ],
        "authors": [
            "Yan Chen",
            "Yi Wen",
            "Wei Li",
            "Junchao Liu",
            "Yong Guo",
            "Jie Hu",
            "Xinghao Chen"
        ],
        "tldr": "The paper introduces RDDM, a RAW domain diffusion model for real-world image restoration, addressing limitations of sRGB-domain diffusion methods by directly processing sensor RAW data and employing a novel training pipeline with a RAW-domain VAE and differentiable Post Tone Processing module.",
        "tldr_zh": "该论文介绍了RDDM，一种用于真实世界图像恢复的RAW域扩散模型。它通过直接处理传感器原始数据，并采用一种新颖的训练流程，包括RAW域VAE和可微分的后期色调处理模块，从而解决了sRGB域扩散方法的局限性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]