[
    {
        "title": "Degradation-Aware All-in-One Image Restoration via Latent Prior Encoding",
        "summary": "Real-world images often suffer from spatially diverse degradations such as\nhaze, rain, snow, and low-light, significantly impacting visual quality and\ndownstream vision tasks. Existing all-in-one restoration (AIR) approaches\neither depend on external text prompts or embed hand-crafted architectural\npriors (e.g., frequency heuristics); both impose discrete, brittle assumptions\nthat weaken generalization to unseen or mixed degradations. To address this\nlimitation, we propose to reframe AIR as learned latent prior inference, where\ndegradation-aware representations are automatically inferred from the input\nwithout explicit task cues. Based on latent priors, we formulate AIR as a\nstructured reasoning paradigm: (1) which features to route (adaptive feature\nselection), (2) where to restore (spatial localization), and (3) what to\nrestore (degradation semantics). We design a lightweight decoding module that\nefficiently leverages these latent encoded cues for spatially-adaptive\nrestoration. Extensive experiments across six common degradation tasks, five\ncompound settings, and previously unseen degradations demonstrate that our\nmethod outperforms state-of-the-art (SOTA) approaches, achieving an average\nPSNR improvement of 1.68 dB while being three times more efficient.",
        "url": "http://arxiv.org/abs/2509.17792v1",
        "published_date": "2025-09-22T13:51:09+00:00",
        "updated_date": "2025-09-22T13:51:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "S M A Sharif",
            "Abdur Rehman",
            "Fayaz Ali Dharejo",
            "Radu Timofte",
            "Rizwan Ali Naqvi"
        ],
        "tldr": "This paper introduces a novel all-in-one image restoration (AIR) approach that uses learned latent priors to address various degradations, outperforming SOTA methods with improved efficiency and generalization.",
        "tldr_zh": "本文提出了一种新颖的All-in-One图像恢复(AIR)方法，该方法使用学习到的潜在先验来解决各种退化问题，在提高效率和泛化能力的同时，优于SOTA方法。",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]