[
    {
        "title": "DroneSR: Rethinking Few-shot Thermal Image Super-Resolution from Drone-based Perspective",
        "summary": "Although large scale models achieve significant improvements in performance,\nthe overfitting challenge still frequently undermines their generalization\nability. In super resolution tasks on images, diffusion models as\nrepresentatives of generative models typically adopt large scale architectures.\nHowever, few-shot drone-captured infrared training data frequently induces\nsevere overfitting in large-scale architectures. To address this key challenge,\nour method proposes a new Gaussian quantization representation learning method\noriented to diffusion models that alleviates overfitting and enhances\nrobustness. At the same time, an effective monitoring mechanism tracks large\nscale architectures during training to detect signs of overfitting. By\nintroducing Gaussian quantization representation learning, our method\neffectively reduces overfitting while maintaining architecture complexity. On\nthis basis, we construct a multi source drone-based infrared image benchmark\ndataset for detection and use it to emphasize overfitting issues of large scale\narchitectures in few sample, drone-based diverse drone-based image\nreconstruction scenarios. To verify the efficacy of the method in mitigating\noverfitting, experiments are conducted on the constructed benchmark.\nExperimental results demonstrate that our method outperforms existing super\nresolution approaches and significantly mitigates overfitting of large scale\narchitectures under complex conditions. The code and DroneSR dataset will be\navailable at: https://github.com/wengzp1/GARLSR.",
        "url": "http://arxiv.org/abs/2509.01898v1",
        "published_date": "2025-09-02T02:37:42+00:00",
        "updated_date": "2025-09-02T02:37:42+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zhipeng Weng",
            "Xiaopeng Liu",
            "Ce Liu",
            "Xingyuan Guo",
            "Yukai Shi",
            "Liang Lin"
        ],
        "tldr": "This paper introduces a Gaussian quantization representation learning method for diffusion models to address overfitting issues in few-shot drone-captured thermal image super-resolution. They also create a new benchmark dataset for this task.",
        "tldr_zh": "本文提出了一种用于扩散模型的高斯量化表示学习方法，以解决少样本无人机捕获的热图像超分辨率中的过拟合问题。他们还为此任务创建了一个新的基准数据集。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Clinical Metadata Guided Limited-Angle CT Image Reconstruction",
        "summary": "Limited-angle computed tomography (LACT) offers improved temporal resolution\nand reduced radiation dose for cardiac imaging, but suffers from severe\nartifacts due to truncated projections. To address the ill-posedness of LACT\nreconstruction, we propose a two-stage diffusion framework guided by structured\nclinical metadata. In the first stage, a transformer-based diffusion model\nconditioned exclusively on metadata, including acquisition parameters, patient\ndemographics, and diagnostic impressions, generates coarse anatomical priors\nfrom noise. The second stage further refines the images by integrating both the\ncoarse prior and metadata to produce high-fidelity results. Physics-based data\nconsistency is enforced at each sampling step in both stages using an\nAlternating Direction Method of Multipliers module, ensuring alignment with the\nmeasured projections. Extensive experiments on both synthetic and real cardiac\nCT datasets demonstrate that incorporating metadata significantly improves\nreconstruction fidelity, particularly under severe angular truncation. Compared\nto existing metadata-free baselines, our method achieves superior performance\nin SSIM, PSNR, nMI, and PCC. Ablation studies confirm that different types of\nmetadata contribute complementary benefits, particularly diagnostic and\ndemographic priors under limited-angle conditions. These findings highlight the\ndual role of clinical metadata in improving both reconstruction quality and\nefficiency, supporting their integration into future metadata-guided medical\nimaging frameworks.",
        "url": "http://arxiv.org/abs/2509.01752v1",
        "published_date": "2025-09-01T20:14:15+00:00",
        "updated_date": "2025-09-01T20:14:15+00:00",
        "categories": [
            "cs.CV",
            "physics.med-ph"
        ],
        "authors": [
            "Yu Shi",
            "Shuyi Fan",
            "Changsheng Fang",
            "Shuo Han",
            "Haodong Li",
            "Li Zhou",
            "Bahareh Morovati",
            "Dayang Wang",
            "Hengyong Yu"
        ],
        "tldr": "This paper proposes a two-stage diffusion framework guided by clinical metadata for limited-angle CT image reconstruction, achieving superior performance compared to metadata-free baselines. It leverages metadata such as acquisition parameters and patient demographics to improve image fidelity and reconstruction quality.",
        "tldr_zh": "本文提出了一种基于临床元数据的两阶段扩散框架，用于有限角CT图像重建，与无元数据基线相比，实现了卓越的性能。它利用采集参数和患者人口统计等元数据来提高图像保真度和重建质量。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]