[
    {
        "title": "Thinking-while-Generating: Interleaving Textual Reasoning throughout Visual Generation",
        "summary": "Recent advances in visual generation have increasingly explored the integration of reasoning capabilities. They incorporate textual reasoning, i.e., think, either before (as pre-planning) or after (as post-refinement) the generation process, yet they lack on-the-fly multimodal interaction during the generation itself. In this preliminary study, we introduce Thinking-while-Generating (TwiG), the first interleaved framework that enables co-evolving textual reasoning throughout the visual generation process. As visual content is progressively generating, textual reasoning is interleaved to both guide upcoming local regions and reflect on previously synthesized ones. This dynamic interplay produces more context-aware and semantically rich visual outputs. To unveil the potential of this framework, we investigate three candidate strategies, zero-shot prompting, supervised fine-tuning (SFT) on our curated TwiG-50K dataset, and reinforcement learning (RL) via a customized TwiG-GRPO strategy, each offering unique insights into the dynamics of interleaved reasoning. We hope this work inspires further research into interleaving textual reasoning for enhanced visual generation. Code will be released at: https://github.com/ZiyuGuo99/Thinking-while-Generating.",
        "url": "http://arxiv.org/abs/2511.16671v1",
        "published_date": "2025-11-20T18:59:52+00:00",
        "updated_date": "2025-11-20T18:59:52+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL"
        ],
        "authors": [
            "Ziyu Guo",
            "Renrui Zhang",
            "Hongyu Li",
            "Manyuan Zhang",
            "Xinyan Chen",
            "Sifan Wang",
            "Yan Feng",
            "Peng Pei",
            "Pheng-Ann Heng"
        ],
        "tldr": "This paper introduces Thinking-while-Generating (TwiG), a framework for interleaving textual reasoning with visual generation to achieve more context-aware and semantically rich outputs, exploring zero-shot prompting, supervised fine-tuning, and reinforcement learning strategies.",
        "tldr_zh": "本文介绍了Thinking-while-Generating (TwiG)，一个将文本推理与视觉生成交织在一起的框架，旨在实现更具上下文感知和语义丰富的输出，并探索了零样本提示、监督微调和强化学习策略。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]