[
    {
        "title": "Seeing Through the Rain: Resolving High-Frequency Conflicts in Deraining and Super-Resolution via Diffusion Guidance",
        "summary": "Clean images are crucial for visual tasks such as small object detection, especially at high resolutions. However, real-world images are often degraded by adverse weather, and weather restoration methods may sacrifice high-frequency details critical for analyzing small objects. A natural solution is to apply super-resolution (SR) after weather removal to recover both clarity and fine structures. However, simply cascading restoration and SR struggle to bridge their inherent conflict: removal aims to remove high-frequency weather-induced noise, while SR aims to hallucinate high-frequency textures from existing details, leading to inconsistent restoration contents. In this paper, we take deraining as a case study and propose DHGM, a Diffusion-based High-frequency Guided Model for generating clean and high-resolution images. DHGM integrates pre-trained diffusion priors with high-pass filters to simultaneously remove rain artifacts and enhance structural details. Extensive experiments demonstrate that DHGM achieves superior performance over existing methods, with lower costs.",
        "url": "http://arxiv.org/abs/2511.12419v1",
        "published_date": "2025-11-16T02:16:14+00:00",
        "updated_date": "2025-11-16T02:16:14+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Wenjie Li",
            "Jinglei Shi",
            "Jin Han",
            "Heng Guo",
            "Zhanyu Ma"
        ],
        "tldr": "The paper introduces DHGM, a diffusion-based model, to address the conflict between deraining and super-resolution by integrating pre-trained diffusion priors with high-pass filters to remove rain artifacts and enhance structural details simultaneously, achieving superior performance at lower costs.",
        "tldr_zh": "该论文介绍了一种基于扩散的模型DHGM，通过整合预训练的扩散先验和高通滤波器，同时去除雨水伪影并增强结构细节，从而解决了去雨和超分辨率之间的冲突，并以较低的成本实现了卓越的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]