[
    {
        "title": "InfraDiffusion: zero-shot depth map restoration with diffusion models and prompted segmentation from sparse infrastructure point clouds",
        "summary": "Point clouds are widely used for infrastructure monitoring by providing\ngeometric information, where segmentation is required for downstream tasks such\nas defect detection. Existing research has automated semantic segmentation of\nstructural components, while brick-level segmentation (identifying defects such\nas spalling and mortar loss) has been primarily conducted from RGB images.\nHowever, acquiring high-resolution images is impractical in low-light\nenvironments like masonry tunnels. Point clouds, though robust to dim lighting,\nare typically unstructured, sparse, and noisy, limiting fine-grained\nsegmentation. We present InfraDiffusion, a zero-shot framework that projects\nmasonry point clouds into depth maps using virtual cameras and restores them by\nadapting the Denoising Diffusion Null-space Model (DDNM). Without task-specific\ntraining, InfraDiffusion enhances visual clarity and geometric consistency of\ndepth maps. Experiments on masonry bridge and tunnel point cloud datasets show\nsignificant improvements in brick-level segmentation using the Segment Anything\nModel (SAM), underscoring its potential for automated inspection of masonry\nassets. Our code and data is available at\nhttps://github.com/Jingyixiong/InfraDiffusion-official-implement.",
        "url": "http://arxiv.org/abs/2509.03324v1",
        "published_date": "2025-09-03T14:01:10+00:00",
        "updated_date": "2025-09-03T14:01:10+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yixiong Jing",
            "Cheng Zhang",
            "Haibing Wu",
            "Guangming Wang",
            "Olaf Wysocki",
            "Brian Sheil"
        ],
        "tldr": "InfraDiffusion is a zero-shot framework using diffusion models to restore depth maps generated from sparse infrastructure point clouds, enabling brick-level segmentation for automated masonry inspection using SAM without task-specific training.",
        "tldr_zh": "InfraDiffusion是一个零样本框架，它使用扩散模型来恢复从稀疏基础设施点云生成的深度图，从而可以使用SAM进行砖块级别的分割，以实现砌体结构的自动检测，无需特定任务的训练。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "DCDB: Dynamic Conditional Dual Diffusion Bridge for Ill-posed Multi-Tasks",
        "summary": "Conditional diffusion models have made impressive progress in the field of\nimage processing, but the characteristics of constructing data distribution\npathways make it difficult to exploit the intrinsic correlation between tasks\nin multi-task scenarios, which is even worse in ill-posed tasks with a lack of\ntraining data. In addition, traditional static condition control makes it\ndifficult for networks to learn in multi-task scenarios with its dynamically\nevolving characteristics. To address these challenges, we propose a dynamic\nconditional double diffusion bridge training paradigm to build a general\nframework for ill-posed multi-tasks. Firstly, this paradigm decouples the\ndiffusion and condition generation processes, avoiding the dependence of the\ndiffusion model on supervised data in ill-posed tasks. Secondly, generated by\nthe same noise schedule, dynamic conditions are used to gradually adjust their\nstatistical characteristics, naturally embed time-related information, and\nreduce the difficulty of network learning. We analyze the learning objectives\nof the network under different conditional forms in the single-step denoising\nprocess and compare the changes in its attention weights in the network,\ndemonstrating the superiority of our dynamic conditions. Taking dehazing and\nvisible-infrared fusion as typical ill-posed multi-task scenarios, we achieve\nthe best performance in multiple indicators on public datasets. The code has\nbeen publicly released at: https://anonymous.4open.science/r/DCDB-D3C2.",
        "url": "http://arxiv.org/abs/2509.03044v1",
        "published_date": "2025-09-03T06:12:53+00:00",
        "updated_date": "2025-09-03T06:12:53+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Chengjie Huang",
            "Jiafeng Yan",
            "Jing Li",
            "Lu Bai"
        ],
        "tldr": "The paper introduces a Dynamic Conditional Dual Diffusion Bridge (DCDB) for ill-posed multi-task image processing, decoupling diffusion and condition generation with dynamic conditions to improve performance in tasks like dehazing and visible-infrared fusion.",
        "tldr_zh": "本文提出了一种动态条件双扩散桥（DCDB），用于解决不适定的多任务图像处理问题。该方法通过解耦扩散和条件生成，并使用动态条件来提高在诸如去雾和可见光-红外融合等任务中的性能。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]