[
    {
        "title": "Satellite Image Utilization for Dehazing with Swin Transformer-Hybrid U-Net and Watershed loss",
        "summary": "Satellite imagery plays a crucial role in various fields; however,\natmospheric interference and haze significantly degrade image clarity and\nreduce the accuracy of information extraction. To address these challenges,\nthis paper proposes a hybrid dehazing framework that integrates Swin\nTransformer and U-Net to balance global context learning and local detail\nrestoration, called SUFERNOBWA. The proposed network employs SwinRRDB, a Swin\nTransformer-based Residual-in-Residual Dense Block, in both the encoder and\ndecoder to effectively extract features. This module enables the joint learning\nof global contextual information and fine spatial structures, which is crucial\nfor structural preservation in satellite image. Furthermore, we introduce a\ncomposite loss function that combines L2 loss, guided loss, and a novel\nwatershed loss, which enhances structural boundary preservation and ensures\npixel-level accuracy. This architecture enables robust dehazing under diverse\natmospheric conditions while maintaining structural consistency across restored\nimages. Experimental results demonstrate that the proposed method outperforms\nstate-of-the-art models on both the RICE and SateHaze1K datasets. Specifically,\non the RICE dataset, the proposed approach achieved a PSNR of 33.24 dB and an\nSSIM of 0.967, which is a significant improvement over existing method. This\nstudy provides an effective solution for mitigating atmospheric interference in\nsatellite imagery and highlights its potential applicability across diverse\nremote sensing applications.",
        "url": "http://arxiv.org/abs/2509.00835v1",
        "published_date": "2025-08-31T13:07:20+00:00",
        "updated_date": "2025-08-31T13:07:20+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jongwook Si",
            "Sungyoung Kim"
        ],
        "tldr": "This paper introduces a Swin Transformer and U-Net hybrid network with a novel watershed loss for satellite image dehazing, demonstrating state-of-the-art performance on RICE and SateHaze1K datasets.",
        "tldr_zh": "该论文提出了一种结合 Swin Transformer 和 U-Net 的混合网络，并引入了新的 watershed loss 用于卫星图像去雾，在 RICE 和 SateHaze1K 数据集上表现出最先进的性能。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]