[
    {
        "title": "CATformer: Contrastive Adversarial Transformer for Image Super-Resolution",
        "summary": "Super-resolution remains a promising technique to enhance the quality of\nlow-resolution images. This study introduces CATformer (Contrastive Adversarial\nTransformer), a novel neural network integrating diffusion-inspired feature\nrefinement with adversarial and contrastive learning. CATformer employs a\ndual-branch architecture combining a primary diffusion-inspired transformer,\nwhich progressively refines latent representations, with an auxiliary\ntransformer branch designed to enhance robustness to noise through learned\nlatent contrasts. These complementary representations are fused and decoded\nusing deep Residual-in-Residual Dense Blocks for enhanced reconstruction\nquality. Extensive experiments on benchmark datasets demonstrate that CATformer\noutperforms recent transformer-based and diffusion-inspired methods both in\nefficiency and visual image quality. This work bridges the performance gap\namong transformer-, diffusion-, and GAN-based methods, laying a foundation for\npractical applications of diffusion-inspired transformers in super-resolution.",
        "url": "http://arxiv.org/abs/2508.17708v1",
        "published_date": "2025-08-25T06:30:18+00:00",
        "updated_date": "2025-08-25T06:30:18+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Qinyi Tian",
            "Spence Cox",
            "Laura E. Dalton"
        ],
        "tldr": "The paper introduces CATformer, a novel super-resolution method combining diffusion-inspired transformers with adversarial and contrastive learning, achieving state-of-the-art performance on benchmark datasets.",
        "tldr_zh": "该论文介绍了CATformer，一种新颖的超分辨率方法，它将扩散启发的Transformer与对抗学习和对比学习相结合，在基准数据集上实现了最先进的性能。",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "Incorporating Pre-trained Diffusion Models in Solving the Schrödinger Bridge Problem",
        "summary": "This paper aims to unify Score-based Generative Models (SGMs), also known as\nDiffusion models, and the Schr\\\"odinger Bridge (SB) problem through three\nreparameterization techniques: Iterative Proportional Mean-Matching (IPMM),\nIterative Proportional Terminus-Matching (IPTM), and Iterative Proportional\nFlow-Matching (IPFM). These techniques significantly accelerate and stabilize\nthe training of SB-based models. Furthermore, the paper introduces novel\ninitialization strategies that use pre-trained SGMs to effectively train\nSB-based models. By using SGMs as initialization, we leverage the advantages of\nboth SB-based models and SGMs, ensuring efficient training of SB-based models\nand further improving the performance of SGMs. Extensive experiments\ndemonstrate the significant effectiveness and improvements of the proposed\nmethods. We believe this work contributes to and paves the way for future\nresearch on generative models.",
        "url": "http://arxiv.org/abs/2508.18095v1",
        "published_date": "2025-08-25T14:56:16+00:00",
        "updated_date": "2025-08-25T14:56:16+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Zhicong Tang",
            "Tiankai Hang",
            "Shuyang Gu",
            "Dong Chen",
            "Baining Guo"
        ],
        "tldr": "This paper introduces three reparameterization techniques (IPMM, IPTM, IPFM) and novel initialization strategies using pre-trained Score-based Generative Models (SGMs) to improve the training and performance of Schrödinger Bridge (SB) models, thereby enhancing generative models.",
        "tldr_zh": "本文提出了三种重参数化技术（IPMM、IPTM、IPFM）以及利用预训练的基于分数的生成模型（SGMs）的新型初始化策略，以提高薛定谔桥（SB）模型的训练和性能，从而改进生成模型。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "UniSino: Physics-Driven Foundational Model for Universal CT Sinogram Standardization",
        "summary": "During raw-data acquisition in CT imaging, diverse factors can degrade the\ncollected sinograms, with undersampling and noise leading to severe artifacts\nand noise in reconstructed images and compromising diagnostic accuracy.\nConventional correction methods rely on manually designed algorithms or fixed\nempirical parameters, but these approaches often lack generalizability across\nheterogeneous artifact types. To address these limitations, we propose UniSino,\na foundation model for universal CT sinogram standardization. Unlike existing\nfoundational models that operate in image domain, UniSino directly standardizes\ndata in the projection domain, which enables stronger generalization across\ndiverse undersampling scenarios. Its training framework incorporates the\nphysical characteristics of sinograms, enhancing generalization and enabling\nrobust performance across multiple subtasks spanning four benchmark datasets.\nExperimental results demonstrate thatUniSino achieves superior reconstruction\nquality both single and mixed undersampling case, demonstrating exceptional\nrobustness and generalization in sinogram enhancement for CT imaging. The code\nis available at: https://github.com/yqx7150/UniSino.",
        "url": "http://arxiv.org/abs/2508.17816v1",
        "published_date": "2025-08-25T09:12:14+00:00",
        "updated_date": "2025-08-25T09:12:14+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Xingyu Ai",
            "Shaoyu Wang",
            "Zhiyuan Jia",
            "Ao Xu",
            "Hongming Shan",
            "Jianhua Ma",
            "Qiegen Liu"
        ],
        "tldr": "The paper introduces UniSino, a foundation model for CT sinogram standardization in the projection domain, designed to address artifacts and noise caused by undersampling and other factors during raw-data acquisition, leading to improved reconstruction quality.",
        "tldr_zh": "该论文介绍了UniSino，一个用于CT sinogram标准化的基础模型，它在投影域中运行，旨在解决由欠采样和其他因素引起的伪影和噪声，从而提高重建质量。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]