[
    {
        "title": "PRISM: Probabilistic and Robust Inverse Solver with Measurement-Conditioned Diffusion Prior for Blind Inverse Problems",
        "summary": "Diffusion models are now commonly used to solve inverse problems in\ncomputational imaging. However, most diffusion-based inverse solvers require\ncomplete knowledge of the forward operator to be used. In this work, we\nintroduce a novel probabilistic and robust inverse solver with\nmeasurement-conditioned diffusion prior (PRISM) to effectively address blind\ninverse problems. PRISM offers a technical advancement over current methods by\nincorporating a powerful measurement-conditioned diffusion model into a\ntheoretically principled posterior sampling scheme. Experiments on blind image\ndeblurring validate the effectiveness of the proposed method, demonstrating the\nsuperior performance of PRISM over state-of-the-art baselines in both image and\nblur kernel recovery.",
        "url": "http://arxiv.org/abs/2509.16106v1",
        "published_date": "2025-09-19T15:49:03+00:00",
        "updated_date": "2025-09-19T15:49:03+00:00",
        "categories": [
            "eess.IV",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Yuanyun Hu",
            "Evan Bell",
            "Guijin Wang",
            "Yu Sun"
        ],
        "tldr": "This paper introduces PRISM, a novel diffusion-based inverse solver for blind inverse problems, demonstrating superior performance in image and blur kernel recovery compared to state-of-the-art methods.",
        "tldr_zh": "本文介绍了PRISM，一种新颖的基于扩散的逆求解器，用于盲逆问题，与最先进的方法相比，在图像和模糊核恢复方面表现出卓越的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Recent Advancements in Microscopy Image Enhancement using Deep Learning: A Survey",
        "summary": "Microscopy image enhancement plays a pivotal role in understanding the\ndetails of biological cells and materials at microscopic scales. In recent\nyears, there has been a significant rise in the advancement of microscopy image\nenhancement, specifically with the help of deep learning methods. This survey\npaper aims to provide a snapshot of this rapidly growing state-of-the-art\nmethod, focusing on its evolution, applications, challenges, and future\ndirections. The core discussions take place around the key domains of\nmicroscopy image enhancement of super-resolution, reconstruction, and\ndenoising, with each domain explored in terms of its current trends and their\npractical utility of deep learning.",
        "url": "http://arxiv.org/abs/2509.15363v1",
        "published_date": "2025-09-18T19:03:41+00:00",
        "updated_date": "2025-09-18T19:03:41+00:00",
        "categories": [
            "eess.IV",
            "cs.AI",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Debasish Dutta",
            "Neeharika Sonowal",
            "Risheraj Barauh",
            "Deepjyoti Chetia",
            "Sanjib Kr Kalita"
        ],
        "tldr": "This survey paper summarizes recent advancements in microscopy image enhancement using deep learning, focusing on super-resolution, reconstruction, and denoising. It highlights current trends and practical applications.",
        "tldr_zh": "该综述论文总结了使用深度学习的显微镜图像增强技术的最新进展，重点关注超分辨率、重建和去噪。它强调了当前的趋势和实际应用。",
        "relevance_score": 8,
        "novelty_claim_score": 4,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Kuramoto Orientation Diffusion Models",
        "summary": "Orientation-rich images, such as fingerprints and textures, often exhibit\ncoherent angular directional patterns that are challenging to model using\nstandard generative approaches based on isotropic Euclidean diffusion.\nMotivated by the role of phase synchronization in biological systems, we\npropose a score-based generative model built on periodic domains by leveraging\nstochastic Kuramoto dynamics in the diffusion process. In neural and physical\nsystems, Kuramoto models capture synchronization phenomena across coupled\noscillators -- a behavior that we re-purpose here as an inductive bias for\nstructured image generation. In our framework, the forward process performs\n\\textit{synchronization} among phase variables through globally or locally\ncoupled oscillator interactions and attraction to a global reference phase,\ngradually collapsing the data into a low-entropy von Mises distribution. The\nreverse process then performs \\textit{desynchronization}, generating diverse\npatterns by reversing the dynamics with a learned score function. This approach\nenables structured destruction during forward diffusion and a hierarchical\ngeneration process that progressively refines global coherence into fine-scale\ndetails. We implement wrapped Gaussian transition kernels and periodicity-aware\nnetworks to account for the circular geometry. Our method achieves competitive\nresults on general image benchmarks and significantly improves generation\nquality on orientation-dense datasets like fingerprints and textures.\nUltimately, this work demonstrates the promise of biologically inspired\nsynchronization dynamics as structured priors in generative modeling.",
        "url": "http://arxiv.org/abs/2509.15328v1",
        "published_date": "2025-09-18T18:18:49+00:00",
        "updated_date": "2025-09-18T18:18:49+00:00",
        "categories": [
            "cs.LG",
            "cs.CV",
            "q-bio.NC"
        ],
        "authors": [
            "Yue Song",
            "T. Anderson Keller",
            "Sevan Brodjian",
            "Takeru Miyato",
            "Yisong Yue",
            "Pietro Perona",
            "Max Welling"
        ],
        "tldr": "This paper introduces a novel score-based generative model for orientation-rich images (fingerprints, textures) using Kuramoto dynamics to model phase synchronization and desynchronization, achieving competitive results on general images and significant improvements on orientation-dense datasets.",
        "tldr_zh": "本文提出了一种新的基于分数的生成模型，使用 Kuramoto 动力学来模拟相位同步和解同步，用于生成富含方向信息的图像（指纹、纹理），在通用图像上取得了有竞争力的结果，在方向密集型数据集上取得了显著的改进。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]