[
    {
        "title": "Simulating Sinogram-Domain Motion and Correcting Image-Domain Artifacts Using Deep Learning in HR-pQCT Bone Imaging",
        "summary": "Rigid-motion artifacts, such as cortical bone streaking and trabecular\nsmearing, hinder in vivo assessment of bone microstructures in high-resolution\nperipheral quantitative computed tomography (HR-pQCT). Despite various motion\ngrading techniques, no motion correction methods exist due to the lack of\nstandardized degradation models. We optimize a conventional sinogram-based\nmethod to simulate motion artifacts in HR-pQCT images, creating paired datasets\nof motion-corrupted images and their corresponding ground truth, which enables\nseamless integration into supervised learning frameworks for motion correction.\nAs such, we propose an Edge-enhanced Self-attention Wasserstein Generative\nAdversarial Network with Gradient Penalty (ESWGAN-GP) to address motion\nartifacts in both simulated (source) and real-world (target) datasets. The\nmodel incorporates edge-enhancing skip connections to preserve trabecular edges\nand self-attention mechanisms to capture long-range dependencies, facilitating\nmotion correction. A visual geometry group (VGG)-based perceptual loss is used\nto reconstruct fine micro-structural features. The ESWGAN-GP achieves a mean\nsignal-to-noise ratio (SNR) of 26.78, structural similarity index measure\n(SSIM) of 0.81, and visual information fidelity (VIF) of 0.76 for the source\ndataset, while showing improved performance on the target dataset with an SNR\nof 29.31, SSIM of 0.87, and VIF of 0.81. The proposed methods address a\nsimplified representation of real-world motion that may not fully capture the\ncomplexity of in vivo motion artifacts. Nevertheless, because motion artifacts\npresent one of the foremost challenges to more widespread adoption of this\nmodality, these methods represent an important initial step toward implementing\ndeep learning-based motion correction in HR-pQCT.",
        "url": "http://arxiv.org/abs/2509.10961v1",
        "published_date": "2025-09-13T19:43:05+00:00",
        "updated_date": "2025-09-13T19:43:05+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Farhan Sadik",
            "Christopher L. Newman",
            "Stuart J. Warden",
            "Rachel K. Surowiec"
        ],
        "tldr": "This paper proposes a deep learning method (ESWGAN-GP) to correct motion artifacts in HR-pQCT bone images by simulating motion in the sinogram domain and training on paired data, showing promising results on both simulated and real-world datasets.",
        "tldr_zh": "该论文提出了一种深度学习方法 (ESWGAN-GP)，通过模拟正弦图域中的运动并在配对数据上进行训练来校正 HR-pQCT 骨骼图像中的运动伪影，并在模拟和真实世界数据集中都显示出有希望的结果。",
        "relevance_score": 7,
        "novelty_claim_score": 6,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]