[
    {
        "title": "Hallucination Score: Towards Mitigating Hallucinations in Generative Image Super-Resolution",
        "summary": "Generative super-resolution (GSR) currently sets the state-of-the-art in\nterms of perceptual image quality, overcoming the \"regression-to-the-mean\" blur\nof prior non-generative models. However, from a human perspective, such models\ndo not fully conform to the optimal balance between quality and fidelity.\nInstead, a different class of artifacts, in which generated details fail to\nperceptually match the low resolution image (LRI) or ground-truth image (GTI),\nis a critical but under studied issue in GSR, limiting its practical\ndeployments. In this work, we focus on measuring, analyzing, and mitigating\nthese artifacts (i.e., \"hallucinations\"). We observe that hallucinations are\nnot well-characterized with existing image metrics or quality models, as they\nare orthogonal to both exact fidelity and no-reference quality. Instead, we\ntake advantage of a multimodal large language model (MLLM) by constructing a\nprompt that assesses hallucinatory visual elements and generates a\n\"Hallucination Score\" (HS). We find that our HS is closely aligned with human\nevaluations, and also provides complementary insights to prior image metrics\nused for super-resolution (SR) models. In addition, we find certain deep\nfeature distances have strong correlations with HS. We therefore propose to\nalign the GSR models by using such features as differentiable reward functions\nto mitigate hallucinations.",
        "url": "http://arxiv.org/abs/2507.14367v1",
        "published_date": "2025-07-18T21:13:50+00:00",
        "updated_date": "2025-07-18T21:13:50+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Weiming Ren",
            "Raghav Goyal",
            "Zhiming Hu",
            "Tristan Ty Aumentado-Armstrong",
            "Iqbal Mohomed",
            "Alex Levinshtein"
        ],
        "tldr": "This paper introduces a new metric, \"Hallucination Score\", based on multimodal large language models to quantify and mitigate hallucinations in generative super-resolution, showing its alignment with human perception and potential for use as a differentiable reward function.",
        "tldr_zh": "该论文介绍了一种新的度量标准“幻觉得分”，该标准基于多模态大型语言模型来量化和减轻生成式超分辨率中的幻觉，表明其与人类感知的一致性，并可用作可微分的奖励函数。",
        "relevance_score": 10,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]