[
    {
        "title": "VisionCAD: An Integration-Free Radiology Copilot Framework",
        "summary": "Widespread clinical deployment of computer-aided diagnosis (CAD) systems is\nhindered by the challenge of integrating with existing hospital IT\ninfrastructure. Here, we introduce VisionCAD, a vision-based radiological\nassistance framework that circumvents this barrier by capturing medical images\ndirectly from displays using a camera system. The framework operates through an\nautomated pipeline that detects, restores, and analyzes on-screen medical\nimages, transforming camera-captured visual data into diagnostic-quality images\nsuitable for automated analysis and report generation. We validated VisionCAD\nacross diverse medical imaging datasets, demonstrating that our modular\narchitecture can flexibly utilize state-of-the-art diagnostic models for\nspecific tasks. The system achieves diagnostic performance comparable to\nconventional CAD systems operating on original digital images, with an F1-score\ndegradation typically less than 2\\% across classification tasks, while natural\nlanguage generation metrics for automated reports remain within 1\\% of those\nderived from original images. By requiring only a camera device and standard\ncomputing resources, VisionCAD offers an accessible approach for AI-assisted\ndiagnosis, enabling the deployment of diagnostic capabilities in diverse\nclinical settings without modifications to existing infrastructure.",
        "url": "http://arxiv.org/abs/2511.00381v1",
        "published_date": "2025-11-01T03:29:50+00:00",
        "updated_date": "2025-11-01T03:29:50+00:00",
        "categories": [
            "cs.CV",
            "cs.HC"
        ],
        "authors": [
            "Jiaming Li",
            "Junlei Wu",
            "Sheng Wang",
            "Honglin Xiong",
            "Jiangdong Cai",
            "Zihao Zhao",
            "Yitao Zhu",
            "Yuan Yin",
            "Dinggang Shen",
            "Qian Wang"
        ],
        "tldr": "VisionCAD is a framework that uses a camera to capture medical images from displays, processes them into diagnostic-quality images, and allows for AI-assisted diagnosis without requiring integration with existing hospital IT infrastructure. It demonstrates comparable performance to conventional CAD systems.",
        "tldr_zh": "VisionCAD是一个框架，它使用相机从显示器捕获医学图像，将其处理成诊断质量的图像，并允许在不需要与现有医院IT基础设施集成的情况下进行AI辅助诊断。 其性能与传统的CAD系统相当。",
        "relevance_score": 6,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 7
    }
]