[
    {
        "title": "Subtractive Modulative Network with Learnable Periodic Activations",
        "summary": "We propose the Subtractive Modulative Network (SMN), a novel, parameter-efficient Implicit Neural Representation (INR) architecture inspired by classical subtractive synthesis. The SMN is designed as a principled signal processing pipeline, featuring a learnable periodic activation layer (Oscillator) that generates a multi-frequency basis, and a series of modulative mask modules (Filters) that actively generate high-order harmonics. We provide both theoretical analysis and empirical validation for our design. Our SMN achieves a PSNR of $40+$ dB on two image datasets, comparing favorably against state-of-the-art methods in terms of both reconstruction accuracy and parameter efficiency. Furthermore, consistent advantage is observed on the challenging 3D NeRF novel view synthesis task. Supplementary materials are available at https://inrainbws.github.io/smn/.",
        "url": "http://arxiv.org/abs/2602.16337v1",
        "published_date": "2026-02-18T10:20:50+00:00",
        "updated_date": "2026-02-18T10:20:50+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Tiou Wang",
            "Zhuoqian Yang",
            "Markus Flierl",
            "Mathieu Salzmann",
            "Sabine Süsstrunk"
        ],
        "tldr": "The paper proposes a novel Implicit Neural Representation (INR) architecture called Subtractive Modulative Network (SMN) inspired by subtractive synthesis, achieving state-of-the-art results on image reconstruction and NeRF tasks with high parameter efficiency.",
        "tldr_zh": "本文提出了一种新颖的隐式神经表示（INR）架构，名为减性调制网络（SMN），其灵感来自减性合成。该方法在图像重建和NeRF任务上实现了最先进的结果，并且具有很高的参数效率。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "B-DENSE: Branching For Dense Ensemble Network Learning",
        "summary": "Inspired by non-equilibrium thermodynamics, diffusion models have achieved state-of-the-art performance in generative modeling. However, their iterative sampling nature results in high inference latency. While recent distillation techniques accelerate sampling, they discard intermediate trajectory steps. This sparse supervision leads to a loss of structural information and introduces significant discretization errors. To mitigate this, we propose B-DENSE, a novel framework that leverages multi-branch trajectory alignment. We modify the student architecture to output $K$-fold expanded channels, where each subset corresponds to a specific branch representing a discrete intermediate step in the teacher's trajectory. By training these branches to simultaneously map to the entire sequence of the teacher's target timesteps, we enforce dense intermediate trajectory alignment. Consequently, the student model learns to navigate the solution space from the earliest stages of training, demonstrating superior image generation quality compared to baseline distillation frameworks.",
        "url": "http://arxiv.org/abs/2602.15971v1",
        "published_date": "2026-02-17T19:40:58+00:00",
        "updated_date": "2026-02-17T19:40:58+00:00",
        "categories": [
            "cs.LG",
            "cs.AI",
            "cs.CV",
            "cs.NE"
        ],
        "authors": [
            "Cherish Puniani",
            "Tushar Kumar",
            "Arnav Bendre",
            "Gaurav Kumar",
            "Shree Singhi"
        ],
        "tldr": "B-DENSE is a novel distillation framework for diffusion models that uses multi-branch trajectory alignment to enforce dense intermediate trajectory alignment, improving image generation quality and addressing the issue of sparse supervision in existing distillation techniques.",
        "tldr_zh": "B-DENSE是一种用于扩散模型的新型蒸馏框架，它使用多分支轨迹对齐来加强密集的中间轨迹对齐，从而提高图像生成质量，并解决了现有蒸馏技术中稀疏监督的问题。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]