[
    {
        "title": "ClearAIR: A Human-Visual-Perception-Inspired All-in-One Image Restoration",
        "summary": "All-in-One Image Restoration (AiOIR) has advanced significantly, offering promising solutions for complex real-world degradations. However, most existing approaches rely heavily on degradation-specific representations, often resulting in oversmoothing and artifacts. To address this, we propose ClearAIR, a novel AiOIR framework inspired by Human Visual Perception (HVP) and designed with a hierarchical, coarse-to-fine restoration strategy. First, leveraging the global priority of early HVP, we employ a Multimodal Large Language Model (MLLM)-based Image Quality Assessment (IQA) model for overall evaluation. Unlike conventional IQA, our method integrates cross-modal understanding to more accurately characterize complex, composite degradations. Building upon this overall assessment, we then introduce a region awareness and task recognition pipeline. A semantic cross-attention, leveraging semantic guidance unit, first produces coarse semantic prompts. Guided by this regional context, a degradation-aware module implicitly captures region-specific degradation characteristics, enabling more precise local restoration. Finally, to recover fine details, we propose an internal clue reuse mechanism. It operates in a self-supervised manner to mine and leverage the intrinsic information of the image itself, substantially enhancing detail restoration. Experimental results show that ClearAIR achieves superior performance across diverse synthetic and real-world datasets.",
        "url": "http://arxiv.org/abs/2601.02763v1",
        "published_date": "2026-01-06T06:55:08+00:00",
        "updated_date": "2026-01-06T06:55:08+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Xu Zhang",
            "Huan Zhang",
            "Guoli Wang",
            "Qian Zhang",
            "Lefei Zhang"
        ],
        "tldr": "The paper introduces ClearAIR, an All-in-One Image Restoration framework inspired by Human Visual Perception, utilizing a hierarchical, coarse-to-fine restoration strategy with MLLM-based IQA, semantic cross-attention, and internal clue reuse for superior performance.",
        "tldr_zh": "该论文介绍了 ClearAIR，一个受人类视觉感知启发的All-in-One图像修复框架，采用分层、由粗到精的修复策略，利用基于MLLM的IQA、语义交叉注意和内部线索重用，实现了卓越的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Annealed Langevin Posterior Sampling (ALPS): A Rapid Algorithm for Image Restoration with Multiscale Energy Models",
        "summary": "Solving inverse problems in imaging requires models that support efficient inference, uncertainty quantification, and principled probabilistic reasoning. Energy-Based Models (EBMs), with their interpretable energy landscapes and compositional structure, are well-suited for this task but have historically suffered from high computational costs and training instability. To overcome the historical shortcomings of EBMs, we introduce a fast distillation strategy to transfer the strengths of pre-trained diffusion models into multi-scale EBMs. These distilled EBMs enable efficient sampling and preserve the interpretability and compositionality inherent to potential-based frameworks. Leveraging EBM compositionality, we propose Annealed Langevin Posterior Sampling (ALPS) algorithm for Maximum-A-Posteriori (MAP), Minimum Mean Square Error (MMSE), and uncertainty estimates for inverse problems in imaging. Unlike diffusion models that use complex guidance strategies for latent variables, we perform annealing on static posterior distributions that are well-defined and composable. Experiments on image inpainting and MRI reconstruction demonstrate that our method matches or surpasses diffusion-based baselines in both accuracy and efficiency, while also supporting MAP recovery. Overall, our framework offers a scalable and principled solution for inverse problems in imaging, with potential for practical deployment in scientific and clinical settings. ALPS code is available at the GitHub repository \\href{https://github.com/JyoChand/ALPS}{ALPS}.",
        "url": "http://arxiv.org/abs/2601.02594v1",
        "published_date": "2026-01-05T22:53:23+00:00",
        "updated_date": "2026-01-05T22:53:23+00:00",
        "categories": [
            "eess.IV",
            "cs.AI",
            "cs.CV"
        ],
        "authors": [
            "Jyothi Rikhab Chand",
            "Mathews Jacob"
        ],
        "tldr": "This paper introduces Annealed Langevin Posterior Sampling (ALPS), a fast algorithm for image restoration using multi-scale Energy-Based Models (EBMs) distilled from diffusion models, demonstrating competitive accuracy and efficiency compared to diffusion-based methods while supporting MAP recovery.",
        "tldr_zh": "本文介绍了一种名为 Annealed Langevin Posterior Sampling (ALPS) 的快速图像恢复算法，该算法使用从扩散模型中提炼的多尺度能量模型 (EBM)。实验表明，与基于扩散的方法相比，该算法在准确性和效率方面具有竞争力，同时支持 MAP 恢复。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]