[
    {
        "title": "All-in-One Video Restoration under Smoothly Evolving Unknown Weather Degradations",
        "summary": "All-in-one image restoration aims to recover clean images from diverse unknown degradations using a single model. But extending this task to videos faces unique challenges. Existing approaches primarily focus on frame-wise degradation variation, overlooking the temporal continuity that naturally exists in real-world degradation processes. In practice, degradation types and intensities evolve smoothly over time, and multiple degradations may coexist or transition gradually. In this paper, we introduce the Smoothly Evolving Unknown Degradations (SEUD) scenario, where both the active degradation set and degradation intensity change continuously over time. To support this scenario, we design a flexible synthesis pipeline that generates temporally coherent videos with single, compound, and evolving degradations. To address the challenges in the SEUD scenario, we propose an all-in-One Recurrent Conditional and Adaptive prompting Network (ORCANet). First, a Coarse Intensity Estimation Dehazing (CIED) module estimates haze intensity using physical priors and provides coarse dehazed features as initialization. Second, a Flow Prompt Generation (FPG) module extracts degradation features. FPG generates both static prompts that capture segment-level degradation types and dynamic prompts that adapt to frame-level intensity variations. Furthermore, a label-aware supervision mechanism improves the discriminability of static prompt representations under different degradations. Extensive experiments show that ORCANet achieves superior restoration quality, temporal consistency, and robustness over image and video-based baselines. Code is available at https://github.com/Friskknight/ORCANet-SEUD.",
        "url": "http://arxiv.org/abs/2601.00533v1",
        "published_date": "2026-01-02T02:20:57+00:00",
        "updated_date": "2026-01-02T02:20:57+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Wenrui Li",
            "Hongtao Chen",
            "Yao Xiao",
            "Wangmeng Zuo",
            "Jiantao Zhou",
            "Yonghong Tian",
            "Xiaopeng Fan"
        ],
        "tldr": "The paper introduces a new scenario, Smoothly Evolving Unknown Degradations (SEUD), for video restoration and proposes an all-in-one recurrent network (ORCANet) with prompting mechanisms to address this challenge, demonstrating superior performance in experiments.",
        "tldr_zh": "该论文引入了一种新的视频修复场景，即平滑演变的未知退化（SEUD），并提出了一个具有提示机制的all-in-one循环网络（ORCANet）来应对这一挑战，实验表明其性能优越。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]