[
    {
        "title": "Physics Encoded Spatial and Temporal Generative Adversarial Network for Tropical Cyclone Image Super-resolution",
        "summary": "High-resolution satellite imagery is indispensable for tracking the genesis, intensification, and trajectory of tropical cyclones (TCs). However, existing deep learning-based super-resolution (SR) methods often treat satellite image sequences as generic videos, neglecting the underlying atmospheric physical laws governing cloud motion. To address this, we propose a Physics Encoded Spatial and Temporal Generative Adversarial Network (PESTGAN) for TC image super-resolution. Specifically, we design a disentangled generator architecture incorporating a PhyCell module, which approximates the vorticity equation via constrained convolutions and encodes the resulting approximate physical dynamics as implicit latent representations to separate physical dynamics from visual textures. Furthermore, a dual-discriminator framework is introduced, employing a temporal discriminator to enforce motion consistency alongside spatial realism. Experiments on the Digital Typhoon dataset for 4$\\times$ upscaling demonstrate that PESTGAN establishes a better performance in structural fidelity and perceptual quality. While maintaining competitive pixel-wise accuracy compared to existing approaches, our method significantly excels in reconstructing meteorologically plausible cloud structures with superior physical fidelity.",
        "url": "http://arxiv.org/abs/2602.17277v1",
        "published_date": "2026-02-19T11:26:01+00:00",
        "updated_date": "2026-02-19T11:26:01+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Ruoyi Zhang",
            "Jiawei Yuan",
            "Lujia Ye",
            "Runling Yu",
            "Liling Zhao"
        ],
        "tldr": "The paper introduces PESTGAN, a physics-encoded GAN for tropical cyclone image super-resolution, incorporating physical dynamics via a PhyCell module and a dual-discriminator framework to improve structural fidelity and physical plausibility.",
        "tldr_zh": "该论文介绍了PESTGAN，一种物理编码的GAN，用于热带气旋图像超分辨率。它通过PhyCell模块整合物理动力学，并采用双判别器框架，以提高结构保真度和物理合理性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "DDiT: Dynamic Patch Scheduling for Efficient Diffusion Transformers",
        "summary": "Diffusion Transformers (DiTs) have achieved state-of-the-art performance in image and video generation, but their success comes at the cost of heavy computation. This inefficiency is largely due to the fixed tokenization process, which uses constant-sized patches throughout the entire denoising phase, regardless of the content's complexity. We propose dynamic tokenization, an efficient test-time strategy that varies patch sizes based on content complexity and the denoising timestep. Our key insight is that early timesteps only require coarser patches to model global structure, while later iterations demand finer (smaller-sized) patches to refine local details. During inference, our method dynamically reallocates patch sizes across denoising steps for image and video generation and substantially reduces cost while preserving perceptual generation quality. Extensive experiments demonstrate the effectiveness of our approach: it achieves up to $3.52\\times$ and $3.2\\times$ speedup on FLUX-1.Dev and Wan $2.1$, respectively, without compromising the generation quality and prompt adherence.",
        "url": "http://arxiv.org/abs/2602.16968v1",
        "published_date": "2026-02-19T00:15:20+00:00",
        "updated_date": "2026-02-19T00:15:20+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Dahye Kim",
            "Deepti Ghadiyaram",
            "Raghudeep Gadde"
        ],
        "tldr": "The paper introduces a dynamic patch scheduling method (DDiT) for Diffusion Transformers, which adapts patch sizes during the denoising process based on content complexity and timestep, significantly improving inference speed without compromising generation quality.",
        "tldr_zh": "该论文介绍了一种用于扩散Transformer的动态patch调度方法(DDiT)，该方法根据内容复杂度和时间步长在去噪过程中调整patch大小，从而在不影响生成质量的前提下显著提高推理速度。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]