[
    {
        "title": "One-step Latent-free Image Generation with Pixel Mean Flows",
        "summary": "Modern diffusion/flow-based models for image generation typically exhibit two core characteristics: (i) using multi-step sampling, and (ii) operating in a latent space. Recent advances have made encouraging progress on each aspect individually, paving the way toward one-step diffusion/flow without latents. In this work, we take a further step towards this goal and propose \"pixel MeanFlow\" (pMF). Our core guideline is to formulate the network output space and the loss space separately. The network target is designed to be on a presumed low-dimensional image manifold (i.e., x-prediction), while the loss is defined via MeanFlow in the velocity space. We introduce a simple transformation between the image manifold and the average velocity field. In experiments, pMF achieves strong results for one-step latent-free generation on ImageNet at 256x256 resolution (2.22 FID) and 512x512 resolution (2.48 FID), filling a key missing piece in this regime. We hope that our study will further advance the boundaries of diffusion/flow-based generative models.",
        "url": "http://arxiv.org/abs/2601.22158v1",
        "published_date": "2026-01-29T18:59:56+00:00",
        "updated_date": "2026-01-29T18:59:56+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yiyang Lu",
            "Susie Lu",
            "Qiao Sun",
            "Hanhong Zhao",
            "Zhicheng Jiang",
            "Xianbang Wang",
            "Tianhong Li",
            "Zhengyang Geng",
            "Kaiming He"
        ],
        "tldr": "This paper introduces \"pixel MeanFlow\" (pMF), a novel one-step, latent-free image generation method achieving competitive FID scores on ImageNet, bridging a gap in diffusion/flow-based generative models.",
        "tldr_zh": "本文介绍了“像素均值流”(pMF)，一种新颖的单步、无潜在空间的图像生成方法，在ImageNet上取得了具有竞争力的FID分数，弥补了扩散/流生成模型中的一个空白。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    }
]