[
    {
        "title": "Likelihood-Separable Diffusion Inference for Multi-Image MRI Super-Resolution",
        "summary": "Diffusion models are the current state-of-the-art for solving inverse problems in imaging. Their impressive generative capability allows them to approximate sampling from a prior distribution, which alongside a known likelihood function permits posterior sampling without retraining the model. While recent methods have made strides in advancing the accuracy of posterior sampling, the majority focuses on single-image inverse problems. However, for modalities such as magnetic resonance imaging (MRI), it is common to acquire multiple complementary measurements, each low-resolution along a different axis. In this work, we generalize common diffusion-based inverse single-image problem solvers for multi-image super-resolution (MISR) MRI. We show that the DPS likelihood correction allows an exactly-separable gradient decomposition across independently acquired measurements, enabling MISR without constructing a joint operator, modifying the diffusion model, or increasing network function evaluations. We derive MISR versions of DPS, DMAP, DPPS, and diffusion-based PnP/ADMM, and demonstrate substantial gains over SISR across $4\\times/8\\times/16\\times$ anisotropic degradations. Our results achieve state-of-the-art super-resolution of anisotropic MRI volumes and, critically, enable reconstruction of near-isotropic anatomy from routine 2D multi-slice acquisitions, which are otherwise highly degraded in orthogonal views.",
        "url": "http://arxiv.org/abs/2601.14030v1",
        "published_date": "2026-01-20T14:53:20+00:00",
        "updated_date": "2026-01-20T14:53:20+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Samuel W. Remedios",
            "Zhangxing Bian",
            "Shuwen Wei",
            "Aaron Carass",
            "Jerry L. Prince",
            "Blake E. Dewey"
        ],
        "tldr": "This paper generalizes diffusion-based single-image super-resolution methods to the multi-image super-resolution problem in MRI, achieving state-of-the-art results and enabling reconstruction of near-isotropic anatomy from routine 2D multi-slice acquisitions.",
        "tldr_zh": "本文将基于扩散的单图像超分辨率方法推广到MRI中的多图像超分辨率问题，实现了最先进的结果，并能够从常规的2D多层切片采集重建近乎各向同性的解剖结构。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "SHARE: A Fully Unsupervised Framework for Single Hyperspectral Image Restoration",
        "summary": "Hyperspectral image (HSI) restoration is a fundamental challenge in computational imaging and computer vision. It involves ill-posed inverse problems, such as inpainting and super-resolution. Although deep learning methods have transformed the field through data-driven learning, their effectiveness hinges on access to meticulously curated ground-truth datasets. This fundamentally restricts their applicability in real-world scenarios where such data is unavailable. This paper presents SHARE (Single Hyperspectral Image Restoration with Equivariance), a fully unsupervised framework that unifies geometric equivariance principles with low-rank spectral modelling to eliminate the need for ground truth. SHARE's core concept is to exploit the intrinsic invariance of hyperspectral structures under differentiable geometric transformations (e.g. rotations and scaling) to derive self-supervision signals through equivariance consistency constraints. Our novel Dynamic Adaptive Spectral Attention (DASA) module further enhances this paradigm shift by explicitly encoding the global low-rank property of HSI and adaptively refining local spectral-spatial correlations through learnable attention mechanisms. Extensive experiments on HSI inpainting and super-resolution tasks demonstrate the effectiveness of SHARE. Our method outperforms many state-of-the-art unsupervised approaches and achieves performance comparable to that of supervised methods. We hope that our approach will shed new light on HSI restoration and broader scientific imaging scenarios. The code will be released at https://github.com/xuwayyy/SHARE.",
        "url": "http://arxiv.org/abs/2601.13987v1",
        "published_date": "2026-01-20T14:01:13+00:00",
        "updated_date": "2026-01-20T14:01:13+00:00",
        "categories": [
            "eess.IV",
            "cs.CV"
        ],
        "authors": [
            "Jiangwei Xie",
            "Zhang Wen",
            "Mike Davies",
            "Dongdong Chen"
        ],
        "tldr": "The paper introduces SHARE, a fully unsupervised framework for hyperspectral image restoration tasks like inpainting and super-resolution, leveraging geometric equivariance and low-rank spectral modeling to eliminate the need for ground truth data.",
        "tldr_zh": "该论文介绍了一种名为SHARE的完全无监督的超光谱图像恢复框架，用于修复和超分辨率等任务。它利用几何等变性和低秩光谱建模，无需ground truth数据。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Dynamic Differential Linear Attention: Enhancing Linear Diffusion Transformer for High-Quality Image Generation",
        "summary": "Diffusion transformers (DiTs) have emerged as a powerful architecture for high-fidelity image generation, yet the quadratic cost of self-attention poses a major scalability bottleneck. To address this, linear attention mechanisms have been adopted to reduce computational cost; unfortunately, the resulting linear diffusion transformers (LiTs) models often come at the expense of generative performance, frequently producing over-smoothed attention weights that limit expressiveness. In this work, we introduce Dynamic Differential Linear Attention (DyDiLA), a novel linear attention formulation that enhances the effectiveness of LiTs by mitigating the oversmoothing issue and improving generation quality. Specifically, the novelty of DyDiLA lies in three key designs: (i) dynamic projection module, which facilitates the decoupling of token representations by learning with dynamically assigned knowledge; (ii) dynamic measure kernel, which provides a better similarity measurement to capture fine-grained semantic distinctions between tokens by dynamically assigning kernel functions for token processing; and (iii) token differential operator, which enables more robust query-to-key retrieval by calculating the differences between the tokens and their corresponding information redundancy produced by dynamic measure kernel. To capitalize on DyDiLA, we introduce a refined LiT, termed DyDi-LiT, that systematically incorporates our advancements. Extensive experiments show that DyDi-LiT consistently outperforms current state-of-the-art (SOTA) models across multiple metrics, underscoring its strong practical potential.",
        "url": "http://arxiv.org/abs/2601.13683v1",
        "published_date": "2026-01-20T07:33:16+00:00",
        "updated_date": "2026-01-20T07:33:16+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Boyuan Cao",
            "Xingbo Yao",
            "Chenhui Wang",
            "Jiaxin Ye",
            "Yujie Wei",
            "Hongming Shan"
        ],
        "tldr": "This paper introduces Dynamic Differential Linear Attention (DyDiLA) to improve linear diffusion transformers (LiTs) for high-quality image generation by addressing the oversmoothing issue in linear attention. The resulting DyDi-LiT model outperforms state-of-the-art models.",
        "tldr_zh": "本文介绍了动态差分线性注意力（DyDiLA），通过解决线性注意力中的过度平滑问题，改进了线性扩散变换器（LiTs），从而实现高质量的图像生成。由此产生的 DyDi-LiT 模型优于当前最先进的模型。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "ASBA: A-line State Space Model and B-line Attention for Sparse Optical Doppler Tomography Reconstruction",
        "summary": "Optical Doppler Tomography (ODT) is an emerging blood flow analysis technique. A 2D ODT image (B-scan) is generated by sequentially acquiring 1D depth-resolved raw A-scans (A-line) along the lateral axis (B-line), followed by Doppler phase-subtraction analysis. To ensure high-fidelity B-scan images, current practices rely on dense sampling, which prolongs scanning time, increases storage demands, and limits the capture of rapid blood flow dynamics. Recent studies have explored sparse sampling of raw A-scans to alleviate these limitations, but their effectiveness is hindered by the conservative sampling rates and the uniform modeling of flow and background signals. In this study, we introduce a novel blood flow-aware network, named ASBA (A-line ROI State space model and B-line phase Attention), to reconstruct ODT images from highly sparsely sampled raw A-scans. Specifically, we propose an A-line ROI state space model to extract sparsely distributed flow features along the A-line, and a B-line phase attention to capture long-range flow signals along each B-line based on phase difference. Moreover, we introduce a flow-aware weighted loss function that encourages the network to prioritize the accurate reconstruction of flow signals. Extensive experiments on real animal data demonstrate that the proposed approach clearly outperforms existing state-of-the-art reconstruction methods.",
        "url": "http://arxiv.org/abs/2601.14165v1",
        "published_date": "2026-01-20T17:17:02+00:00",
        "updated_date": "2026-01-20T17:17:02+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zhenghong Li",
            "Wensheng Cheng",
            "Congwu Du",
            "Yingtian Pan",
            "Zhaozheng Yin",
            "Haibin Ling"
        ],
        "tldr": "The paper introduces ASBA, a novel deep learning method utilizing A-line state space models and B-line attention to reconstruct high-fidelity Optical Doppler Tomography (ODT) images from sparsely sampled raw data, outperforming existing methods.",
        "tldr_zh": "该论文介绍了一种名为ASBA的新型深度学习方法，该方法利用A线状态空间模型和B线注意力，从稀疏采样的原始数据中重建高保真光学多普勒断层扫描（ODT）图像，优于现有方法。",
        "relevance_score": 4,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 6
    }
]